trade_exp/src/Documents/АрендаНоменклатурыВозврат/АрендаНоменклатурыВозврат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b577dbdc-2a6b-4b2d-b6cf-0a93b48f1df2">
  <name>АрендаНоменклатурыВозврат</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="e3901c84-75de-46a1-863d-59aedfc4f14a">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="37669b80-5f0d-4859-8cf6-ac1dd38b413d">
    <name>ВернутьКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0dcd20e0-3e3e-4b81-98d9-e069a9ecb9a7">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="371cc52a-75a3-45eb-8dc0-d92862f3bc67">
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="70f4af0e-c196-4068-bc6a-3807dbb3f1df">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d6b7634b-4465-4ade-ba0f-a4c57d7d6cc5">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="293c0735-2c1e-4d96-9750-c9019ff8fe34">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="058cddf0-872e-43cc-8378-80345c5e7272">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="78db0f2d-66e6-4192-abc2-83fc34f2ec80">
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4d451234-16b9-4e75-8444-3a41ee8d691f">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f4a101a1-ccb9-46c9-af17-3fbdc9dd398b">
    <name>ДатаВозвратаФакт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cb6b3e32-e5e7-44cf-9907-e01ef8b3225b">
    <name>СуммаУслуг</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="85fda3ba-c7ae-4f55-a1c7-da66cb7bb5cd">
    <name>СуммаЗалога</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f79debbe-ceed-4aac-bc88-8cf8df82df76">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b50aa1f2-b6d6-4558-8409-2e20f83b1338">
    <name>ДатаСдачиВАренду</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="a2379c0c-4eb1-4eba-a219-f9fc5791c645">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="1f071d60-9c4d-4980-8801-caab222b97c9">
      <name>ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75be784e-694a-43ca-adb4-1bbe575e97b8">
      <name>УслугаАренды</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="201e8bc2-0588-4a5f-8ec6-f4544ff8bc28">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7cd4c673-05a1-4f63-ad60-280c2798e5a7">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5f60a5e6-bee1-4cc6-b10e-cd5e4e47eaed">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c25caf32-20e2-40ae-a10e-2a35939bd3a2">
      <name>Период</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c4657879-4faa-4ac3-99a8-43288988dfdb">
      <name>КоличествоУслуги</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5d48325f-35a7-4124-920e-97d78344b8fc">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b1921686-2250-4b72-8442-dbd4021e6cf3">
      <name>ЦенаУслуги</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2c36ffd4-5c5f-4003-a280-3a0703441e53">
      <name>СуммаСНДСУслуги</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3bf3c2e8-cc67-4c9a-82a1-85a627b70355">
      <name>СуммаЗалога</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="6b428f1b-e0af-4cc5-90ce-7d26bc5a7ada">
      <name>ДатаСдачиВАренду</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2e2a3cf6-adec-4c52-a3de-1c02f1ff140a">
      <name>ДатаВозврата</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/АрендаНоменклатуры/АрендаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>АрендаНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="966054c7-5235-482e-b7ef-15ace606ebe4">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c78dceba-50e8-4a3a-a189-e0760aabee53">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c94dfe3d-8911-4256-a142-56e1f43c983d">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="95c7f89a-c817-4972-84cf-d247b0380708">
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="00337579-5832-4d28-81cc-32fbfc41ec80">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e6edf55c-070b-4085-88b1-42ee5c4ac2e6">
    <name>ДатаСдачиВАренду</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5cb6017c-244e-47bb-9962-3b1ec3a31dcf">
    <name>ДатаВозврата</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="59141cf6-ba27-416a-b77b-31cf9d3d543d">
    <name>СуммаУслуг</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="fcd1bab2-b145-415d-a939-c3ca529402ef">
    <name>СуммаЗалога</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7782ab60-d402-404d-8054-62575936bba4">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bfb71ace-feb4-440a-be59-7c5e4e13b134">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a36040b2-042c-4b2f-96f1-c42e400bc7f3">
    <name>КартаЛояльности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="874bb0b2-2466-4cbf-be1c-093ad26e65c0">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a976ece0-ac77-417e-8b2d-0962b97145c9">
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="277e9b24-4633-4cf3-819b-447bfbf8959d">
    <name>ВозвратОднойДатой</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d7d7fce9-a9a8-4b47-8ce8-1df200b57792">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6b72c666-ceb1-478a-b71c-104ac8b9e06c">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="ccdb1b7f-3811-4474-8d82-b9392008cb37">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="4d570980-c1b7-454e-bf59-c595c475658d">
      <name>ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="20c4d67c-cf72-44c7-a6cc-f9347489b7a2">
      <name>ДатаВозврата</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1dee34e4-71aa-48f9-a004-2116675a31ad">
      <name>ЦенаУслуги</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6778c420-c4bd-4ba5-bde6-a062087b5271">
      <name>СуммаЗалога</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="aac6aef2-88ab-4d3e-8331-c4b02c35eb75">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ccbc682f-b82c-42b9-acb5-dae9839d6c53">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e79414f3-52e7-4477-a11f-1e5f81f0754f">
      <name>УслугаАренды</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d842a7a8-1e16-430f-9c57-f7ef29f5ecd3">
      <name>Период</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9ac114a8-1e27-442e-8a46-45dda0972b02">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="60fb7b62-9cd6-47b6-a642-6696dada9849">
      <name>КоличествоУслуги</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1d9739fe-52ea-440d-b9f4-1855645fc816">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="860ca8e7-dc30-498a-9223-564dea61ee2c">
      <name>СуммаСНДСУслуги</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/АрендаНоменклатурыВозврат/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
&Вместо("ОбработкаЗаполнения")
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АрендаНоменклатуры") Тогда
		Основание= ДанныеЗаполнения;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,,"Дата,Номер,Автор");
		
		ТЗ= Документы.АрендаНоменклатурыВозврат.ПолучитьТоварДляВозврата(ЭтотОбъект);
		Товары.Загрузить(ТЗ);
	КонецЕсли;
	
	СуммаУслуг= Товары.Итог("СуммаСНДСУслуги");	
	СуммаЗалога= Товары.Итог("СуммаЗалога");
	
	Автор= Пользователи.ТекущийПользователь();
КонецПроцедуры

&Вместо("ОбработкаПроведения")
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр АрендаНоменклатуры Приход
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.АрендаНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.ДокументАренды= Основание;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Подразделение = Подразделение;
		Движение.Партнер = Партнер;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Характеристика = ТекСтрокаТовары.Характеристика;
		Движение.КАренде = 0;
		Движение.ВАренде = ТекСтрокаТовары.Количество;
		Движение.СтоимостьАренды = 0;
		Движение.ДатаВозврата = ДатаВозвратаФакт;
	КонецЦикла;
	Движения.АрендаНоменклатуры.Записать(Истина);
	
	Документы.АрендаНоменклатуры.СоздатьДокументПеремещение(Ссылка, Отказ);
	
	Если Основание.Статус = Перечисления.СтатусыАренды.ВАренде И Не Отказ Тогда
		ЕстьОстатки = Документы.АрендаНоменклатуры.ЕстьОстаткиПоАренде(Основание);
		Если Не ЕстьОстатки Тогда
			ДокАренды = Основание.ПолучитьОбъект();
			ДокАренды.Статус = Перечисления.СтатусыАренды.Выполнен;
			ДокАренды.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить("Аренда переведена в статус Выполнен");
		КонецЕсли;
	КонецЕсли;
	
	Если Основание.Статус = Перечисления.СтатусыАренды.Выполнен И Не Отказ Тогда	
		ЕстьОстатки = Документы.АрендаНоменклатуры.ЕстьОстаткиПоАренде(Основание);
		Если ЕстьОстатки Тогда
			ДокАренды = Основание.ПолучитьОбъект();
			ДокАренды.Статус = Перечисления.СтатусыАренды.ВАренде;
			ДокАренды.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить("Аренда переведена в статус К Заказу");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&Вместо("ПередЗаписью")
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьОплата = Документы.АрендаНоменклатуры.ЕстьПКО_РКО(Ссылка);
	Если ЕстьОплата Тогда
		Сообщить("Документ оплачен!");
		Если Не РольДоступна("ПолныеПрава") Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&Вместо("ОбработкаУдаленияПроведения")
Процедура ОбработкаУдаленияПроведения(Отказ)
	Документы.АрендаНоменклатуры.УдалитьДокументПеремещение(Ссылка, Отказ);
КонецПроцедуры

&Вместо("ПриЗаписи")
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Проведен И Основание.Статус = Перечисления.СтатусыАренды.Выполнен И Не Отказ Тогда	
			ДокАренды = Основание.ПолучитьОбъект();
			ДокАренды.Статус = Перечисления.СтатусыАренды.ВАренде;
			ДокАренды.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить("Аренда переведена в статус В Аренде");
		КонецЕсли;
		
КонецПроцедуры

#КонецЕсли
